import pandas as pd

data = {
    'Возраст': [23, 34, 24, 29, 30, 27, 26, 22, 28, 32],
    'Зарплата': [50000, 52000, 54000, 55000, 60000, 57000, 55000, 51000, 53000, 59000],

}
df = pd.DataFrame(data)

#stdA = df['Возраст'].std()
#stdB = df['Зарплата'].std()

print(f"стандартное отклонение Возраст - {stdA}")
print(f"стандартное отклонение Зарплата - {stdB}")
print(df.describe())

print(f"Средний возраст - {df['Возраст'].mean()}")
print(f"Медианный возраст - {df['Возраст'].median()}")
print(f"стандартное отклонение Возраст - {df['Возраст'].std()}")

print(f"Средняя ЗП - {df['Зарплата'].mean()}")
print(f"Медианная ЗП - {df['Зарплата'].median()}")
print(f"стандартное отклонение ЗП - {df['Зарплата'].std()}")